vllm_qwen235b_MI308/fp8/in-10000-out-1000-max-concurrency-32-tp8.log
INFO 12-15 12:13:16 [__init__.py:241] Automatically detected platform rocm.
[aiter] import [module_aiter_enum] under /usr/local/lib/python3.12/dist-packages/aiter/jit/module_aiter_enum.so
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7050e4183f60>, seed=123, num_prompts=160, dataset_name='random', no_stream=False, dataset_path=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=10000, random_output_len=1000, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, endpoint_type='openai', label=None, backend='vllm', base_url=None, host='localhost', port=8899, endpoint='/v1/completions', max_concurrency=32, model='/shared/amdgpu/home/share/Qwen/models--Qwen--Qwen3-235B-A22B-Instruct-2507-FP8/snapshots/e156cb4efae43fbee1a1ab073f946a1377e6b969', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
INFO 12-15 12:13:19 [datasets.py:509] Sampling input_len from [10000, 10000] and output_len from [1000, 1000]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |          | 00:18 elapsed, 2294:51:06 remaining
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 160/160 [02:48<00:00,  1.05s/it]
============ Serving Benchmark Result ============
Successful requests:                     160       
Maximum request concurrency:             32        
Benchmark duration (s):                  168.65    
Total input tokens:                      1599950   
Total generated tokens:                  160000    
Request throughput (req/s):              0.95      
Output token throughput (tok/s):         948.69    
Total Token throughput (tok/s):          10435.32  
---------------Time to First Token----------------
Mean TTFT (ms):                          4064.75   
Median TTFT (ms):                        4260.85   
P99 TTFT (ms):                           8365.73   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          29.67     
Median TPOT (ms):                        29.29     
P99 TPOT (ms):                           33.24     
---------------Inter-token Latency----------------
Mean ITL (ms):                           29.67     
Median ITL (ms):                         25.21     
P99 ITL (ms):                            26.86     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          33702.18  
Median E2EL (ms):                        33642.95  
P99 E2EL (ms):                           36441.31  
==================================================